var datadict = {
	// 事件类型
	eventType: {
		et01: "申请 - 申请条件",
		et02: "申请 - 申请渠道相关",
		et03: "申请 - 二次申请咨询",
		et04: "申请 - 合同状态查询",
		et05: "申请 - 审核进度",
		et06: "商品相关 - 商品质量咨询",
		et07: "商品相关 - 退换货咨询",
		et08: "还款相关 - 还款渠道",
		et09: "还款相关 - 还款金额",
		et10: "还款相关 - 提前还款咨询",
		et11: "还款相关 - 还款日期",
		et12: "还款相关 - 款项是否到账",
		et13: "还款相关 - 退款",
		//et14: "客户请求 - 查询个人信息",
		et15: "客户请求 - 更改个人信息",
		et16: "客户请求 - 投诉",
		et17: "客户请求 - 上传照片",
		et18: "客户请求 - 取消合同",
		et19: "客户请求 - VOC",
		et20: "客户请求 - 取消保险",
		et21: "回拨 - 欢迎电话回拨",
		et22: "回拨 - 审核电话回拨",
		et23: "回拨 - 短信回拨",
		et24: "闪银相关 - 放款信息",
		et25: "闪银相关 - 修改信息",
		et26: "闪银相关 - 保险咨询",
		et27: "其他 - 其他",
		et50: "修改银行代扣信息",
		et51: "申请银行代扣",
		et52: "取消银行代扣",
		et53: "申请提前还款",
		et54: "取消提前还款",
		et55: "取消合同保险"
	},
	
	// 合同状态
	contractStatus: {
		status_0: "待审核",
		status_1: "审核中",
		status_2: "审核通过",
		status_3: "合同激活",
		status_50: "合同完结",
		status_51: "审核未通过",
		status_52: "撤销"
	},
	
	// 电话仓库类型
	phoneRepoType: {
		office: "办公电话",
		home: "家庭电话",
		emergency: "紧急联系电话",
		mobile: "注册手机"
	},
	
	// 电话仓库装态
	phoneRepoStatus: {
		enabled: "启用",
		unable: "未启用"
	},
	
	// 电话仓库验证状态
	phoneValidStatus: {
		yes: "是",
		no: "否"
	},
	
	bankCodeToNameMap: {
		"102": "中国工商银行",
		"104": "中国银行",
		"103": "中国农业银行",
		"403": "中国邮政储蓄银行",
		"105": "中国建设银行",
		"313": "中国光大银行",
		"308": "招商银行",
		"301": "交通银行",
		"310": "上海浦东发展银行",
		"304": "华夏银行",
		"307": "深圳发展银行",
		"307": "平安银行",
		"305": "中国民生银行",
		"302": "中信实业银行",
		"306": "广东发展银行",
		"309": "兴业银行"
	},
	
	bankNameToCodeMap: {
		"中国工商银行": "102", 
		"中国银行": "104",
		"中国农业银行": "103",
		"中国邮政储蓄银行": "403",
		"中国建设银行": "105",
		"中国光大银行": "313",
		"招商银行": "308",
		"交通银行": "301",
		"上海浦东发展银行": "310",
		"华夏银行": "304",
		"深圳发展银行": "307",
		"平安银行": "307",
		"中国民生银行": "305",
		"中信实业银行": "302",
		"广东发展银行": "306",
		"兴业银行": "309"
	}
};
